/*
Задача 58: Задайте две матрицы. Напишите программу, которая будет находить произведение двух матриц.
Например, даны 2 матрицы:
2 4 | 3 4
3 2 | 3 3
Результирующая матрица будет:
18 20
15 18
*/
int[,] a = { { 2, 4 }, { 3, 2 } };
int[,] b = { { 3, 4 }, { 3, 3 } };
int[,] c = new int[2, 2];

for (int i = 0; i < 2; i++)
{
    for (int j = 0; j < 2; j++)
    {
        for (int k = 0; k < 2; k++)
        {
            c[i, j] += a[i, k] * b[k, j];
        }
    }
}

Console.WriteLine("Результат:");
for (int i = 0; i < 2; i++)
{
    for (int j = 0; j < 2; j++)
    {
        Console.Write("{0} ", c[i, j]);
    }
    Console.WriteLine();
}